{
    "skills": {
        "Kubernetes": "I've developed and deployed applications at scale at General Motors using Kubernetes",
        "Ray": "Ray is a framework for distributed computing, designed for scaling AI and machine learning workloads across large clusters of machines with ease.",
        "Apache Spark": "I became a Spark master at General Motors, debugging and optimizing Spark jobs to process large-scale data efficiently.",
        "Argo": "I developed applications to deploy them in Argo workflows at scale",
        "Helm": "I used helm to install and manage applications on a Kubernetes clusters at General Motors",
        "Docker": "I used Docker for containerization of applications at General Motors and use docker compose in few my side projects",
        "Protocol Buffers": "I defined new protocol buffers in an app written in Go codebase at General Motors",
        "Linux": "I worked with hpc clusters running on linux at General Motors.",
        "Python": "I used Python across many projects at General Motors and on some personal projects",
        "Go": "I learned some Go to work on a project at General Motors for an application for AI/ML teams",
        "SQL": "I wrote entire applications using SQL at General Motors and on some personal projects",
        "Scala": "I used Scala to write Spark jobs at General Motors, to optimize the performance of the jobs",
        "Databricks": "I used Databricks to develop and deploy Spark jobs at General Motors for big data processing",
        "Azure Synapse Analytics": "I used Azure Synapse Analytics to create data pipelines and data migrations at General Motors.",
        "AWS S3": "I used AWS S3 to store and manage large datasets at General Motors.",
        "Azure Data Lake Storage": "Azure Data Lake Storage is a scalable, secure, and high-performance data lake that allows for efficient storage and analysis of large datasets in the cloud.",
        "PostgreSQL": "PostgreSQL is an open-source, advanced relational database management system known for its stability, extensibility, and SQL compliance, widely used in web, mobile, and analytics applications.",
        "Geospatial Data": "Working with geospatial data queries and postGIS a lot over the years.",
        "GeoJSON": "I worked with geojson formats on few geospatial data applications",
        "XML": "I used XML with Spark to process datasets in projects",
        "JSON": "I used JSON to solve many problems ",
        "Parquet": "I became very acquainted with Parquet file format at General Motors, using it to store and process large datasets efficiently.",
        "ORC": "I processed a lot of data stored in ORC format at General Motors.",
        "Hadoop": "I used Hadoop to store and process large datasets at General Motors.",
        "Hive": "I used Hive to query and analyze large datasets stored in Hadoop at General Motors.",
        "MLflow": "MLflow is an open-source platform for managing the machine learning lifecycle, including experimentation, reproducibility, and deployment.",
        "Delta Table": "I became a Delta Table expert at General Motors, using Delta Lake to manage large-scale data lakes with ACID transactions and data versioning.",
        "GitHub": "I use Github repos for managing repositories, code reviews, etc.",
        "Jira": "I have used Jira for project management and issue tracking at General Motors.",
        "Streamlit": "I have used Streamlit to create interactive web apps for portfolio and some data analysis for graphs.",
        "Apache-Sedona": "I have used Apache-Sedona library for geospatial queries in Apache Spark for many projects at General Motors.",
        "KeplerGL": "I have used KeplerGL to visualize geospatial data at General Motors.",
        "Folium": "I have used Folium to visualize geospatial data at General Motors."
    }    
}
